[
    {
        "src": "/primary-images/churchbuilding2.jpg",
        "heading": "Join us for worship!",
        "caption": "Our building may be closed due to COVID-19, but we're still here for you! Check out our worship videos or join a Zoom Bible Study.",
        "text": "",
        "focus": "50% 100%"
    },
    {
        "src": "/primary-images/blessingbox.jpg",
        "heading": "Blessing our neighborhood",
        "caption": "Our community Blessing Box fills important needs for our neighbors.",
        "linktext": "Learn more",
        "focus": "0 25%",
        "text": "<p>Reaching out to our neighbors is an especially important part of our mission. To meet the needs of families in our neighborhood a blessing box was put in place on the south side of the building.  It is labeled: Take What You Need, Leave What You Can, Be Blessed.  Since its beginning in October of 2019, the box is visited daily.  We have discovered that not only is the need great, but the kindness of church and community members helps support this ministry.  Items may be placed directly in the box or in the barrel inside near the pastor’s office. We are glad to divide bulk items into individual packages.</p><p>Items needed:</p><ul><li>Hygiene Items such as deodorant, soap, toothpaste, shampoo, razors</li><li>Personal Items such as toilet paper, pads/tampons, socks, hats, gloves</li><li>Baby items such as diapers and wipes</li><li>Cleaning supplies such as detergent, cleanser, trash bags, dish soap, paper towels</li><li>Non-perishable food items</li></ul>"
    },
    {
        "src": "/uploads/events/congo.jpg",
        "heading": "A Deep History of Fellowship",
        "caption": "First Christian Church celebrates its long relationship with its sister church, New City Church (Nouvelle Cite’ Parish) in Mbandaka, Democratic Republic of Congo.",
        "linktext": "Learn more",
        "focus": "50% 0",
        "text": "<p>FCC has had a connection with the Democratic Republic of Congo for decades. The relationship began when Dr. Gene and Sue Johnson joined our congregation after serving as missionaries in the African nation.  Dr. Johnson spent two terms, 1957-1964 and 1967-1971, in Monieka where he oversaw the medical work and also taught in the school for children of missionaries.  His wife, Sue, supervised back country schools and station finances as well as taught her children in primary grades.</p><p>The Johnson’s shared their love and concern with our congregation and over fifteen years ago a partnership or jumelage began with New City Church (Nouvelle Cite’ Parish) in Mbandaka, DRC.  Each congregation supports the other through prayer and communicating aspects of church life and family and community needs.  Funds are sent to our sister church annually to support a project that improves quality of life for our brothers and sisters in Mbandaka.  We proudly supported microcredit courses that teach women to sew and provide for their families, school supply kiosks at the church which provide affordable supplies and school uniforms, funds to build a new parsonage, wells for potable water and financial support for a much needed new church building.</p><p>It has been our honor to host visits from New City Church member, Oscar Pekombe and also Rev. Christianne Ikete, Director of the Disciples Office of Women and Family in DRC. In 2012, FCC member, Stephanie Line, traveled to Mbandaka and worshipped with our brothers and sisters of New City.  We are committed to continue to promote these cultural and spiritual ties….our Jumelage….with our sister church!</p>"
    },
    {
        "src": "/primary-images/nursinghome.jpg",
        "heading": "Bringing Jesus to others",
        "caption": "Our children spread the love of Jesus Christ in local nursing homes.",
        "text": "",
        "focus": "50% 50%"
    },
    {
        "src": "/primary-images/fellowship1.jpg",
        "heading": "Be the church!",
        "caption": "Don't just attend church - be the church! Our congregation finds ways to serve the community on Be the Church Sunday.",
        "text": "",
        "focus": "20% 0"
    },
    {
        "src": "/primary-images/kitchen2.jpg",
        "heading": "Serving our youth",
        "caption": "Fixing meals for Wednesday night children's and youth groups.",
        "focus": "20% 30%",
        "text": ""
    },
    {
        "src": "/primary-images/kids.jpg",
        "heading": "Golden Age Banquet",
        "caption": "Our annual Golden Age Banquet honors those who teach and lead us every day.",
        "focus": "50% 50%",
        "text": ""
    },
    {
        "src": "/primary-images/joy.jpg",
        "heading": "Christmas at FCC Galesburg",
        "caption": "Children bring the joy during the Christmas season!",
        "text": ""
    }
]