[
    "The people: Just like Jesus Christ, they welcome all with loving, open arms.",
    "The preaching of the Word and our church's ministry to others.",
    "I like Sunday School class and the teacher.",
    "The church is made up of people who are loving, kind, and sharing.",
    "The feeling of family; feeling like I belong. God is in this place!",
    "I love learning about God and Jesus and having fun.",
    "Church service keeping me on track every Sunday.",
    "This is a faith-driven church that helps the community and is led by service-driven pastors!",
    "I love how I am welcomed and remembered when I visit!",
    "Good fellowship and discussion in Sunday School class.",
    "A church secretary that cares and keeps things organized.",
    "I love searching for ways to serve our community!",
    "Pastors Greg and MJ! Also the fellowship with one another.",
    "The music program — a wonderful pipe organ and choirs.",
    "The leadership, including both professional and lay — we have been really blessed!",
    "The love of God is displayed through His people in this church.",
    "Taught me to be creative in the way I worship and to just smile!",
    "We are a FAMILY where everyone is accepted and loved unconditionally.",
    "Growing up in this church has been a true blessing in my life!",
    "Activities. Music. Diversity. Generosity. Discipleship. Outreach.",
    "We are future-focused and always seeking God's mission for us.",
    "The wonderful contemporary band and worshipful praise songs!",
    "This church has become my strength and I feel so loved. Bless this church!",
    "The love and friendship of others.",
    "There are people to pray with you, and a prayer team who prays for every member of the church!",
    "People here truly seem to practice Christianity in their lives and toward each other.",
    "The great people, awesome band, Bible study, Sunday schools, and gatherings.",
    "Our youth! Their thirst for Biblical truths and their hunger for service!",
    "The choir music, and especially the instrumental music during service.",
    "I love that I was baptized here! And I love that people include me in the fun!",
    "Weekly Bible studies and other activities to support each other. Praise God for the inclusive nature that abounds here!",
    "The pastors — their messages and the example they set.",
    "We encourage everyone to help out and get involved. There is always a place for you!",
    "The staff is always available and helpful!"
]